---
kind: property
id: P:Autodesk.Revit.DB.Visual.Metal.MetalFinish
source: html/3b4a64f9-b794-c7f8-4f20-b028d5cc0b9e.htm
---
# Autodesk.Revit.DB.Visual.Metal.MetalFinish Property

The property labeled "Finish" from the "Metal" schema.

## Syntax (C#)
```csharp
public static string MetalFinish { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalFinishType".